[Killed] ArrowFunction
src/components/FavoriteInput.js:16:15
             id="favorite"
             checked={ isFavorite }
             onChange={
-              ({ target: { checked } }) => onUpdateFavoritePokemon(checked)
+              () => undefined
             }
           />
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test /home/anabibi/TRYBE PROJECTS/sd-027-b-project-react-testing-library/.stryker-tmp/sandbox1221588
> react-scripts test "src/tests/PokemonDetails.test.js"


FAIL src/tests/PokemonDetails.test.js

  ✓ Test if the detail info of the selected pokemon are shown on screen  (457 ms)
  ✓ Test if exist on the page a section with the maps containing the poke lo
