[Killed] ArrowFunction
src/components/PokemonData.js:18:27
         <section>
           <h2>{ `Game Locations of ${name}` }</h2>
           <div className="pokemon-habitat">
-            { foundAt.map(({ location, map }) => (
-              <div key={ location }>
-                <img src={ `${map}` } alt={ `${name} location` } />
-                <p><em>{ location }</em></p>
-              </div>
-            )) }
+            { foundAt.map(() => undefined) }
           </div>
         </section>
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test /home/anabibi/TRYBE PROJECTS/sd-027-b-project-react-testing-library/.stryker-tmp/sandbox1221588
> react-scripts test "src/tests/PokemonDetails.test.js"


FAIL src/tests/PokemonDetails.test.js

  ✓ Test if the detail info of the selected pokemon are shown on screen  (472 ms)
