[Killed] ArrowFunction
src/pages/PokemonDetails.js:15:29
   findPokemon(givenId) {
     const { pokemonList } = this.props;
 
-    return pokemonList.find(({ id }) => id === givenId);
+    return pokemonList.find(() => undefined);
   }
 
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test /home/anabibi/TRYBE PROJECTS/sd-027-b-project-react-testing-library/.stryker-tmp/sandbox1221588
> react-scripts test "src/tests/PokemonDetails.test.js"


  console.error
    Error: Uncaught [TypeError: Cannot read properties of undefined (reading 'name')]

[Killed] StringLiteral
src/pages/PokemonDetails.js:30:15
 
     return (
       <section className="pokemon-details">
-        <h2>{ `${pokemon.name} Details` }</h2>
+        <h2>{ `` }</h2>
         <Pokemon
           pokemon={ pokemon }
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test /home/anabibi/TRYBE PROJECTS/sd-027-b-project-react-testing-library/.stryker-tmp/sandbox1221588
> react-scripts test "src/tests/PokemonDetails.test.js"


FAIL src/tests/PokemonDetails.test.js

  ✕ Test if the detail info of the selected pokemon are shown on screen  (900 ms)
  ✓ Test if exist on the page a section with the maps containing the poke lo

[Killed] ArrowFunction
src/pages/PokemonDetails.js:40:13
         <FavoriteInput
           isFavorite={ isFavorite }
           onUpdateFavoritePokemon={
-            (checked) => onUpdateFavoritePokemon(pokemon.id, checked)
+            () => undefined
           }
         />
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test /home/anabibi/TRYBE PROJECTS/sd-027-b-project-react-testing-library/.stryker-tmp/sandbox1221588
> react-scripts test "src/tests/PokemonDetails.test.js"


FAIL src/tests/PokemonDetails.test.js

  ✓ Test if the detail info of the selected pokemon are shown on screen  (468 ms)
